{
    "xero": {
        "title": "Softwareentwickler",
        "location": "Xero",
        "description": "Ich arbeitete im Integrationsteam mit Fokus auf die Backend-Integration interner und externer Dienste. Ich habe umfassende Erfahrung in der Verwaltung von AWS-Umgebungen und der Bereitstellung von Infrastruktur, einschließlich Tests und DevOps-Pipelines. Setzte zuverlässig Alarmierungs- und Überwachungssysteme mit Tools wie New Relic und Sumo Logic um. Zu den Schlüsseltechnologien gehören C#, Node.js, Kotlin, Terraform und SQL sowie umfangreiche Erfahrung mit Cloud-Diensten wie EC2, ECS, SNS, Step Functions und Lambda.",
        "date": "2022 - Gegenwart"
    },
    "xero-internship": {
        "title": "Softwareentwickler - Praktikum",
        "location": "Xero",
        "description": "Ich absolvierte eine dreimonatige Rotation im Developer-Evangelist-Team. Dabei arbeitete ich an der Weiterentwicklung des Xero .NET-SDKs und betreute das externe Marketplace-Programm, das Unternehmen die Integration in die Xero-Plattform ermöglicht. Zu den Highlights gehörten die Entwicklung einer Beispielanwendung zur Demonstration der SDK-Funktionen sowie die Erstellung eines Videos und eines Blogposts zur Einführung der neuen Webhook-Funktion.",
        "date": "Nov 2020 - Feb 2021"
    },
    "unimelb": {
        "title": "Bachelor of Design - Informatik",
        "location": "Universität Melbourne",
        "description": "Ich habe an der University of Melbourne Informatik studiert und mir ein fundiertes Verständnis grundlegender Informatikkonzepte erarbeitet. Die Kurse wurden überwiegend in C und Java durchgeführt. Behandelte Themen waren unter anderem Datenstrukturen und Algorithmen, Big-O-Analyse, neuronale Netze, maschinelles Lernen sowie Netzwerktechnologien. In den Wahlfächern lag der Schwerpunkt auf UX-Design und seinen Prinzipien.",
        "date": "2019 - 2021"
    },
    "legendstudios": {
        "title": "Environment Artist und Softwareentwickler",
        "location": "Legend Studios",
        "description": "Ich trat als freiberuflicher Spieledesigner bei Legend Studios in den USA ein und arbeitete an Dragon Forge, einem inkrementellen Basisaufbau-Abenteuerspiel. Meine Aufgabe war die Gestaltung aller visuellen Aspekte des Spiels, einschließlich der Leistungsoptimierung und der Implementierung umweltbezogener Elemente wie dynamische Beleuchtung, Animationen und ereignisgesteuerte Umwelteffekte.",
        "date": "2020 - 2021"
    },
    "brytenwalda": {
        "title": "Environment Artist und Softwareentwickler",
        "location": "Brytenwalda Studios",
        "description": "Ich arbeitete als freiberuflicher Spieledesigner bei Brytenwalda Studios in Spanien an Beyond Mankind, einem Action-RPG, das auf dem Roman Evil Genes basiert. Meine Aufgabe war die Gestaltung der Level-Umgebungen, einschließlich visueller Aspekte und Level-Designs. Zu meinen Hauptaufgaben gehörten die Leistungsoptimierung sowie die Implementierung dynamischer Beleuchtung und ereignisgesteuerter Umwelteffekte.",
        "date": "2018 - 2019"
    }
}